In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('df.csv')

In [3]:
df.head()

,Name,Mobile Number,Email Address,EngagementScore,Company,Age,MaritalStatus,gender,Exp,Interested,department,City
0,Vijay,919959739997,sekharvij@gmail.com,89.0,Deloitte,24.0,Single,Male,4,Yes,IT,Bangalore
1,Ravindran Nagappan,919840107227,ravi.cti2000@gmail.com,93.0,Microsoft,30.0,Single,Male,14,No,Marketing,Tinsukia
2,Rohit,918408951853,rohitchouhan1119@gmail.com,89.0,CapGemini,30.0,Single,Male,11,Yes,DataBase,Coimbatore
3,Pramod Singh,918586886645,askpramodsingh@gmail.com,55.0,Amazon,50.0,Single,Female,15,No,HumanResources,Ghaziabad
4,Ajay Thakur,917666052926,ajay.thakur244@gmail.com,6.0,Gislen Software,54.0,Married,Female,1,No,Other,Indore

In [4]:
df = df.sample(frac = 1).reset_index(drop = True)

In [5]:
df.head()

,Name,Mobile Number,Email Address,EngagementScore,Company,Age,MaritalStatus,gender,Exp,Interested,department,City
0,APPARAO,919731901980,appu.rongala@gmail.com,6.0,Tech Mahindra,24.0,Single,Male,10,Yes,DataBase,Coimbatore
1,Vaibhav,919959008470,rajvrs85@gmail.com,82.0,CTS,23.0,Single,Male,13,Yes,DataBase,Bangalore
2,Sandesh Mittal,917030632007,sandesh.mittal@gmail.com,36.0,IBM,26.0,Single,Male,11,No,Operations,Jalandhar
3,Devender Ahirwar,918143917044,devenderkumar090@gmail.com,56.0,Toshiba Software India Pvt ltd,44.0,Married,Female,8,Yes,Sales,Pachmarhi
4,Raju Lingampally,919739545462,rajulingampalli@gmail.com,22.0,Wipro,30.0,Single,Male,15,No,HumanResources,Ludhiana

In [6]:
import random

In [7]:
df.shape

(1196, 12)

In [ ]:
0.7*1196

In [8]:
random.seed(1)
train = df.iloc[random.sample(list(range(df.shape[0])),838),:]

In [9]:
train.head()

,Name,Mobile Number,Email Address,EngagementScore,Company,Age,MaritalStatus,gender,Exp,Interested,department,City
275,Datla Venkata,919538221489,rangaraju.19@gmail.com,72.0,CapGemini,47.0,Single,Male,3,Yes,IT,Pondicherry
1165,Jyoti Shukla,917042245577,shukla.jyoti.1101@gmail.com,69.0,Infosys,43.0,Single,Male,11,No,Sales,Mysore
129,Satyajeet Reddy,919673854111,satyajeetreddy@yahoo.com,50.0,Amazon,51.0,Single,Male,14,Yes,Marketing,Surat
522,Shalini BARDHAN,919886310386,shalinibardhan93@gmail.com,52.0,Embassy IT Solutions,46.0,Married,Female,6,Yes,DataBase,Pondicherry
241,Sudipta Paul,918337093337,sudiptapaul1978@gmail.com,80.0,CTS,30.0,Single,Male,19,Yes,Marketing,Lonavala

In [10]:
l1 = list(range(df.shape[0]))

In [11]:
random.seed(1)
l2 = random.sample(list(range(df.shape[0])),838)

In [12]:
type(l2)

list

In [13]:
l3 = []
for i in l1:
    if i not in l2:
        l3.append(i)

In [14]:
test = df.iloc[l3,:]

In [15]:
test.head()

,Name,Mobile Number,Email Address,EngagementScore,Company,Age,MaritalStatus,gender,Exp,Interested,department,City
1,Vaibhav,919959008470,rajvrs85@gmail.com,82.0,CTS,23.0,Single,Male,13,Yes,DataBase,Bangalore
2,Sandesh Mittal,917030632007,sandesh.mittal@gmail.com,36.0,IBM,26.0,Single,Male,11,No,Operations,Jalandhar
6,Venkat,919703087115,pammivenkat@gmail.com,41.0,Google,42.0,Single,Male,8,Yes,Marketing,Solapur
9,Vivek,917666125890,vivek.pervi@gmail.com,52.0,Mindtree,52.0,Married,Female,14,Yes,IT,Madurai
16,Mounika Sabbineni,919108156013,mounikasabbineni@gmail.com,17.0,Infotech Enterprises,43.0,Single,Female,12,No,HumanResources,Delhi

In [17]:
train.Interested.value_counts()/train.shape[0]

Yes    0.704057
No     0.295943
Name: Interested, dtype: float64

In [18]:
test.Interested.value_counts()/test.shape[0]

Yes    0.692737
No     0.307263
Name: Interested, dtype: float64

In [ ]:
.reset_index(drop = True)

In [19]:
train.to_csv('train.csv',index = False)

In [20]:
test.to_csv('test.csv',index = False)